let  Q_A = [
    {
        "Q":"المصروف هو تكلفة مستنفدة لا يترتب عليها عائد.ويعد من الخسائر التي ترحل إلي (ق. أ .خ)",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"النفقة هي المبالغ التي ينفقها صاحب المشروع لشراء المواد الخام",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"عنصر تكلفة الأجور يتمثل في السلع والمعدات والأدوات وكافة المستلزمات السلعية التي تتميز بانها ملموسة وقابلة للتخزين",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"النفقة هي التضحية بالوارد المالية والتي ينتج عنها اما نقص في الأصول او زيادة في الخصوم وذلك لغرض تحقيق منافع اقتصادة محددة",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"النفقة هي التضحية بالوارد المالية والتي ينتج عنها اما نقص في الأصول او زيادة في الخصوم وذلك لغرض تحقيق منافع اقتصادة محددة",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"تهتم محاسبة التكاليف بتسجيل المعلومات المالية فقط وال تهتم بالمعلومات غير المالية",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"تقدم محاسبة التكاليف معلومات لكل من المحاسبة الادارية والمحاسبة المالية وذلك من خلال قياس والتقرير عن المعلومات المالية وغير المالية المرتبطة بتكلفة الحصول على الموارد واستخدامها من قبل المنشأة",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"المصروف هو تكلفة غير مستنفدة او جردية",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"يتمثل هدف المحاسبة الاجتماعية في تحديد تكلفة الوحدة المنتجة سواء كانت سلعة او خدمة، والرقابة عليها، ومساعدة الإدارة في القيام بوظائفها من تخطيط وتنسيق ورقابة واتخاذ قرارات",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"المواد المتاحة لإلستخدام = تتمثل في مخزون مواد خام أول الفترة + المواد الخام المشتراه خلال الفترة",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"محاسبة التكاليف هي علم وفن يشتمل على مجموعة من المبادى والأسس المحاسبية الالزمة لتقدير وتجميع بيانات التكاليف وتسجيلها وعرضها وتحليلها وتبويبها",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"من ضمن اهداف محاسبة الضرائب مساعدة الادارة في اتخاذ قرارات تسعير المنتجات والخدمات المختلفة",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"توفر المحاسبة المالية بيانات تفصيلية وتحليلية ، بينما توفر محاسبة التكاليف بيانات اجمالية فقط",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"إهالك أي آله لم تستخدم في الإنتاج لا يعد خسارة ويعتبر من التكاليف الصناعية غير المباشرة للمنتج",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"تهتم المحاسبة المالية بالتقرير عن العمليات المالية للمنشأة لخدمة الأطراف الخارجية، ويتم ذلك بقياس وتسجيل العمليات وإعداد القوائم المالية طبقا للمبادئ المحاسبية المقبولة قبولًا عاما",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"الأصل هو تضحية بكمية من عوامل الإنتاج من مواد وأجور وخدمات أخري مقابل الحصول علي سلع أو خدمات",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"المواد التي لم تستخدم = مواد تالفة + مواد مباعة + مواد مرتجعة + مواد مسروقة + مخزون مواد خام آخر الفترة",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"الأجور المدفوعة عن وقت ضائع غير مسموح به لا تعتبر عنصر تكلفة ولكنها تعتبر خسارة ترحل إلي قائمة الأرباح والخسائر",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"يتمثل هدف المساعدة في اتخاذ قرارات تسعير المنتجات والخدمات المختلفة من ضمن اهداف محاسبة التكاليف",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"يتم اعداد التقارير في محاسبة التكاليف وفقا لألسس والقواعد التي تضعها إدارة المنشأة ، وحسب المخرجات المطلوب توافرها في التقرير",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"توفر محاسبة التكاليف معلومات تاريخية ومستقبلية بينما توفر المحاسبة المالية بيانات تاريخية فقط ",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"نوعية التقارير في محاسبة التكاليف تتمثل في تقارير داخلية واختيارية تفيد اطراف داخلية تتمثل في جميع المستويات الإدارية",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"التكلفة هي تضحية بكمية من عوامل الإنتاج من مواد وأجور وخدمات أخري مقابل الحصول علي سلع أو خدمات",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"المواد المستخدمة = المواد المتاحة لإلستخدام – ما لم يستخدم",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"إذا علمت أن مخزون مواد خام أول الفترة12000 ج ، مخزون مواد خام آخر الفترة 7000 ج ، مواد مسروقة 500 ج، مواد تالفة 1000 ج، مواد مرتجعة للمورد 4500ج ، مواد مشتراه 40000 ج ، مواد مباعة 4000 ج . فإن تكلفة المواد المستخدمة تساوي 35000 ج",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"بلغت جملة الأجور المدفوعة لعمال الإنتاج 19000 ج، اتضح ان ضمنها 3000ج عن وقت ضائع مسموح به، 1000 ج عن وقت ضائع غير مسموح به. فإن تكلفة الأجورت تساوي 16000 ج.",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"إذا علمت أن مخزون مواد خام أول الفترة 10000 ج ، مخزون مواد خام آخر الفترة 6000 ج ، مواد مشتراه 20000 ج ، مواد مباعة 4000 ج .فإن تكلفة المواد المستخدمة خلال الفترة تساوي 20000",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"عنصر تكلفة المواد تتمثل في السلع والمعدات والأدوات وكافة المستلزمات السلعية التي تتميز بانها ملموسة وقابلة للتخزين",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"عنصر تكلفة الأجور تتمثل في السلع والمعدات والأدوات وكافة المستلزمات السلعية التي تتميز بانها ملموسة وقابلة للتخزين",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"عنصر تكلفة األجور هي كافة التكاليف أو التضحيات التي تتحملها الشركة في سبيل الحصول علي خدمة العنصر البشري، سواء أجور نقدية أو مزايا عينية او حصة الشركة في التأمينات ومرتبات المشرفين والإدارييين",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
]
let  Q_B = [
    
    ]
let  Q_C = [
    // ******اقتصاد كلي*******
    {
        "Q":"يمكن تعريف علم الاقتصاد بانه علم دراسة ندرة الموارد المتاحة في اي مجتمع",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"يمكن القول ان هناك ثلاث عناصر انتاج فقط لازمة لاتمام العملية الانتاجية وهم العمل وراس المال والارض",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"من اهم موضوعات الاقتصاد الجزئي دراسة البطالة وارتفاع المستوى العام للاسعار",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"يوجد تدفق عيني فقط من القطاع العائلي الى القطاع إلانتاجي",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"الاقتصاد الجزئي يدرس سلوك الوحدات الفردية )المستهلك والمنتج أو المؤسسة (عدد النهائي من المستهلكين والمنتجين وفقا لعدد السلع والخدمات)",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"يهتم علم الاقتصاد بدراسة الموارد التي لا تثير مشاكل مثل الهواء",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":`قبل الثلاثينيات من القرن الماضي، كان اهتمام الاقتصاديين بالتحليل الجزئي أشد و أقوى كثيرا من اهتمامهم بالتحليل الكلي`,
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"التحليل الاقتصادي يضم فرعين رئيسيين هما : التحليل الاقتصادي الجزئي والتحليل الاقتصادي الكلي",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":`لم يكن لكتاب كينز " النظرية العامة للعمالة والفائدة والنقود" أثر على النظرية الاقتصادية الكلية`,
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"يهدف علم الاقتصاد الكلى الى تحقيق هدف واحد وهو استقرار مستوى الأسعار",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"تاريخ علم الاقتصاد يسبق تاريخ الفكر الاقتصادي",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"يتمثل الهدف الرئيسي من عملية الاحلال والتجديد بالنسبة للعدد والآلات في الاحتفاظ بالطاقة الإنتاجية للمجتمع",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"الاختلاف بين الناتج المحلى الإجمالي والناتج القومي الصافي يتمثل في وجود الاهلاك",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"نحصل على الناتج الإجمالي بإضافة الاهلاك الى الناتج الصافي",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":`الناتج القومي = الناتج المحلى - عوائد عوامل الإنتاج مع العالم الخارجي + عوائد عوامل الإنتاج الأجنبية التي تعمل داخل مصر`,
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
    {
        "Q":"يقاس الناتج بقيمة سوقية أي بقيمة نقدية ولا يقاس بالكمية ويرجع السبب في ذلك الى اختلاف وحدة قياس السلع والخدمات المختلفة",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"صح"
    },
    {
        "Q":"الناتج هو عملية تحول فيها الموارد الطبيعية بعد إضافة النشاط الانساني عليها الى سلع وخدمات تلبى حاجات الانسان المتزايدة",
        "A":[
            "صح",
            "غلط",
            ],
        "ATrue":"غلط"
    },
]
let  Q_D = [
    {
        "Q":"اجور عمال بالمصنع يمكن تبويها إلي تكاليف اجور",
        "A":[
            "صناعية",
            "تسويقية",
            "إدارية وتمويلية",
            "راسمالية",
            ],
        "ATrue":"صناعية"
    },
]
let  Q_E = [
    {
        "Q":"اجور عمال بالمصنع يمكن تبويها إلي تكاليف اجور",
        "A":[
            "صناعية",
            "تسويقية",
            "إدارية وتمويلية",
            "راسمالية",
            ],
        "ATrue":"صناعية"
    },
]

let  Q_F = [
    {
    "Q":"قد يكون جهاز الشراء قسما أو إدارة أو إدارة عامة أو غيرها",
    "A":[
        "صح",
        "غلط",
    ],
    "ATrue":"صح"
    },
    // {
    //     "Q":"اجراءات الشراء لابد أن يتم من خلالها اجراء عملية",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"اجراءات الشراء ليست هدفا في حد ذاتها ولكنها",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"احدى وظائف المشروع التي تعنى بتسلم وحفظ الاصناف المختلفة بالمستودعات او المخازن لحين طلبها",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"ادارة المشتريات هي الادارة المسؤولة عن تخطيط وتنظيم وتوجيه ورقابة العملية الشرائية",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    {
        "Q":"استلام وصرف الأصناف تقع ضمن مجموعة الأعمال المخازنية المحسابية والمكتبية",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"التخلص من الخردة والفائض والمنتجات المعيبة من مهام نشاط",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"التعريف الشامل لادارة المشتريات والمخازن يركز على",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"التعريف المتكامل لادارة المشتريات هو ان عملية الشراء يجب ان تبنى على اسس علمية سليمة",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    {
        "Q":"التغذية العكسية تختص في تصحيح النظام اذا كان فيه اخطاء",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    {
        "Q":"التكلفة السنوية لنفاد المخزون = عدد وحدات عجز المخزون x نسبة احتمال العجز x",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"تكلفة خسائر نفاد المخزون للوحدة التنظيم في مجال المستودعات هي وظيفة ادارية تستهدف تحديد امور منها:",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"الجودة المناسبة للمواد المشتراه هي",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"الخصم النقدي هو ما يطلق عليه خصم تعجيل الدفع",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    // {
    //     "Q":"الخصم هو الذي يمنحه البائع للمشتري الدفع خلال فترة معينة هو",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"الخصم هو الذي يمنحه البائع للمشتري خلال فترة معينة ويسمح للمورد باستغلال امكانياته هو",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"الخصم هو الذي يمنحه البائع للمشتري عند كمية معينة هو",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"الخصم هو الذي يمنحه البائع للمشتري ويختلف باختلاف ظروف السوق هو",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"الذي يحدد تبعية المستودعات هو",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"السعر العادل بالسوق يكون",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"السعر المناسب هو أقل الأسعار المعروضة",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"المخزون الذي يتم الاحتفاظ به بسبب الوقت الالزم لتصنيع السلع او وجود السلع في المرحلة الإنتقالية هو",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"المخزون الذي يتم الاحتفاظ به للوفاء بطلبات واستخدامات مؤكدة من حيث الكمية",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"ان الوقت من العوامل الغير المهمة التي تؤثر على قرار الشراء السليم ألي منظمة او ألي منشأة",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    {
        "Q":"إن الحد الأقصى للمخزون يحدد الكميات مما يحرم المنشأة الحصول على خصم كمية",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    {
        "Q":"إن العلاقة بين تكلفة التخزين والكمية هي علاقة عكسية",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"تبادل الأصناف بين الادارات من مزايا",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"تتحدد الكمية الاقتصادية للطلب أو للشراء عندما",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"تتضمن ادارة المواد انشطة اساسية",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"تتم عملية الفحص وعملية الاستلام من خلال ادارة المشتريات بمفردها فقط",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    {
        "Q":"تتم عملية الفحص وعملية الاستلام من خلال ادارة المشتريات بمفردها فقط",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"تتميز المناقصة عن الممارسة في أنها",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"تحقق اللامركزية في الشراء علاقات طيبة وجيدة بين المنظمة متمثلة في فروعها والمجتمع المحلي الذي تتواجد فيه",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    {
        "Q":"تحقق المركزية في الشراء علاقات طيبة وجيدة بين المنظمة متمثلة في فروعها والمجتمع المحلي الذي تتواجد فيه",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"تحقق وظيفة التخزين المنفعة",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"تحقق وظيفة التخزين المنفعة",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"تختص وظيفة التخزين بعدم الاحتفاظ بالمواد والاصناف التي تشتريها المنظمة ",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    {
        "Q":"تختص وظيفة التخزين بعدم الإحتفاظ بالمواد والأصناف التي تشتريها المنظمة ",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"تخفيض تكلفة التخزين وتقليل التكاليف الناتجة عن التلف والتقادم وغيرها يعني",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"تخفيض تكلفة التخزين وتقليل التكاليف الناتجة عن التلف والتقادم وغيرها يعني ",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"ترتكز مهمة وظيفة الشراء على توفير المواد والمستلزمات لادارة الانتاج لاتمام عملياتها بشكل جيد",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    // {
    //     "Q":"تساهم وظيفة االنتاج في خلق المنفعة",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"تساهم وظيفة التسويق أو المبيعات في خلق المنفعة",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"تساهم وظيفة النقل في خلق المنفعة",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"تساهم وظيفة النقل في خلق المنفعة",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    // {
    //     "Q":"تعتبر زيادة تكاليف التخزين أحد النتائج السلبية المترتبة على الشراء ",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"تعتبر مزايا المركزية هي عيوب اللامركزية وعيوب المركزية هي مزايا اللامركزية",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    {
        "Q":"تعرف اجراءات الشراء بأنها الخطوة التفصيلية التي يتبعها المسؤولين في وظيفة الشراء اثناء ممارسة الأعمال المتكررة",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    // {
    //     "Q":"تقوم عملية التفاوض الفعالة على تشجيع المزيد من العلاقات",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
    {
        "Q":"تكون تبعية المستودعات تحت ادارتي الانتاج والمبيعات فقط ",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    {
        "Q":"تكون تبعية المستودعات تحت ادارتي الأنتاج والمبيعات فقط",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    {
        "Q":"تمثل وظيفة الشراء اهمية اقل من الوظائف الأخرى بالمنظمة من انتاج وتسويقوموارد بشرية وغيرها",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    {
        "Q":"تنبع وظيفة الشراء من كونها انها تساهم في تحقيق الربح من خلال خفض النفقات المتعلقة بعملية الشراء",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"صح"
    },
    {
        "Q":"تنتهي مهمة جهاز الشراء بإصدار أمر الشراء للمورد.",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    {
        "Q":"تنتهي مهمة نظام الشراء بإصدار امر الشراء للمورد ",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    {
        "Q":"توجد علاقة طردية بين الكمية وتكلفة الشراء أو التوريد",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"توقع انخفاض السعار واحتمال ظهور بدائل جديدة مستقبلا احد الأسباب التي تدفع المنشاة الى الشراء",
    //     "A":[
    //         "صح",
    //         "غلط",
    //     ],
    //     "ATrue":"غلط"
    // },
    {
        "Q":"زيادة مخاطر السرقة او الحريق من النتائج السلبية المترتبة على انخفاض الكمية المشتراه عن الكمية المناسبة سهولة",
        "A":[
            "صح",
            "غلط",
        ],
        "ATrue":"غلط"
    },
    // {
    //     "Q":"سهولة تبادل الأصناف بين الادارات من مزايا",
    //     "A":[
    //         "صح",
    //         "غلط",
    //         "3",
    //         "4",
    //     ],
    //     "ATrue":"صح"
    // },
]
let Matrials =[
    {
        "Matrial":"محاسبة تكاليف",
    },{
        "Matrial":"دراسات ادارية باللغة الانجليزية",
    },{
        "Matrial":"اقتصاد كلي",
    },{
        "Matrial":"تحليل وتصميم نظم المعلومات",
    },{
        "Matrial":"التسويق والتجارة الكترونية",
    },{
        "Matrial":"إدارة مشتريات ومخازن",
    }
]
let select = Q_A;
let done = document.getElementById('done');
let title = document.querySelector('.text');
let option = document.querySelector('.option ul');
let row = document.querySelector(".row");
let YourAnssure = [];
let counter = 0;
let score = 0;
let arr = [];


function Next(){
    let answers = document.getElementsByName('radio');
    if(counter === select.length+1)
    {
        location.reload();
    }
    for(let i = 0; i < answers.length; i++){
        if(answers[i].checked){
        Scoure();
        counter++;
        if (counter === select.length) {
            title.innerHTML = `<h1 id="End">${score}<br>From<br>${counter}</h1>`;
            done.innerHTML = "إعادة";
            document.querySelector(".row span").style.display = "none";
            option.remove();
            counter++;
        }
        else{
            addQuestion(select);
        }
    }
    }
    // console.log(score);
}
function Scoure() {
    let answers = document.getElementsByName('radio');
    // let youranswer;
    
    for(let i = 0; i < answers.length; i++){
        if(answers[i].checked){
            let y = document.getElementById(`${answers[i].id}_id`);
            YourAnssure[arr[counter]] = y.innerText;
            // console.log(YourAnssure)
            if (y.innerText === select[arr[counter]].ATrue) {
                score ++;
            }
        }
    }
}

function addQuestion(text){
    select = text.length;
    random(text.length);
    select = text;
    title.innerHTML = '';
    option.innerHTML = '';
    let title_text = document.createElement("div");
    title_text.id = "text";
    row.appendChild(title_text);
    title.style.display = "block";
    done.style.display = "block";
    let q = document.createElement("h2");
    let qtext = document.createTextNode(text[arr[counter]].Q);
    q.appendChild(qtext);
    title.appendChild(q);
    
    document.querySelector(".row span").innerHTML = `${counter+1} : ${select.length}`;
    for(let i = 0; i < text[counter].A.length; i++)
    {
        //create lablel
        let thelabel = document.createElement("label");
        thelabel.htmlFor = `A_${i}`;
        thelabel.id = `A_${i}_id`
        // let t = arr[counter];
        // console.log(t+1);
        let Atext = document.createTextNode(text[arr[counter]].A[i]);
        thelabel.appendChild(Atext);
        
        //Create input radio
        let inputradio = document.createElement('input')
        inputradio.type = 'radio';
        inputradio.className = 'radio';
        inputradio.id = `A_${i}`;
        inputradio.name = 'radio';

        thelabel.appendChild(inputradio);
        option.append(thelabel);
    }
}
SelectQuestions();

function SelectQuestions(){
    for (let i = 0; i < Matrials.length; i++) {
        document.getElementById(`a${i+1}`).innerHTML = Matrials[i].Matrial;
    }
    document.getElementById('a2').style.display = "none";
    // document.getElementById('a3').style.display = "none";
    document.getElementById('a4').style.display = "none";
    document.getElementById('a5').style.display = "none";
    // document.getElementById('a6').style.display = "none";
    done.style.display = "none";
    title.style.display = "none";
}

function random(max) {
    // console.log("Hello");
    let randomNum = Math.floor(Math.random() * max);
    for (let i = 0; i < arr.length; i++) {
        if (randomNum === arr[i]) {
            randomNum = Math.floor(Math.random() * max);
            i = 0;
        }
    }
    // console.log(randomNum);
    arr[counter] = randomNum;
    // console.log(arr);
}
